In [4]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

df = pd.read_csv('final-employee-ds.csv')
df.head()

,EmployeeID,Name,Age,Gender,Department,ExperienceYears,Salary,WorkHoursPerWeek,PerformanceScore,JoinDate,Tshirt_size,ProjectCount,TrainingHours,DepartmentRating
0,101,Employee_1,50,Male,IT,17,86175.0,44,71,2010-01-10,L,2,4,1
1,102,Employee_2,36,Male,Finance,1,47805.0,44,68,2017-11-11,S,4,18,4
2,103,Employee_3,29,Male,Marketing,16,45237.0,44,69,2012-03-08,S,6,13,3
3,104,Employee_4,42,Male,Marketing,12,60056.0,48,76,2012-10-12,M,2,25,4
4,105,Employee_5,40,Female,Finance,19,85543.0,36,97,2014-12-30,XL,8,3,4

Question : 1
20 Marks
Load the TrainingHours column into a NumPy array.
Convert to float datatype


Find mean & standard deviation

Final output: Two numeric values

In [ ]:
training_hours = np.array(df['TrainingHours'])
training_hours = training_hours.astype(float)

training_hours_mean = np.mean(training_hours)
training_hours_std = np.std(training_hours)

print("Mean of Training Hours:", training_hours_mean.round(2))
print("Standard Deviation of Training Hours:", training_hours_std.round(2))

Mean of Training Hours: 24.19
Standard Deviation of Training Hours: 13.84

Question : 2
20 Marks
Handle missing values (if any):
Fill missing Salary with department-wise median


Calculate total Salary sum for employees with ExperienceYears > 12 and ProjectCount > 5
 
Final output: One numeric value


Question : 3
20 Marks

Filter employees who:
Department = "IT" or "Finance"


Age between 30–45


PerformanceScore > 88


Sort by Salary descending
 
Final output: Table with Name, Department, Salary, PerformanceScore

Question : 4
20 Marks
Add new column SalaryPerHour = Salary ÷ (WorkHoursPerWeek × 4)
Filter top 5 employees by SalaryPerHour
 
Final output: Table(5 Rows) with Name, SalaryPerHour

Question : 5
20 Marks
Create a stacked bar chart showing the count of employees in each Department, separated by Gender.
Dataset Columns Used:
Department → Categorical variable (IT, Finance, HR, Marketing, Management)


Gender → Categorical variable (Male, Female)

Expected Output
A stacked bar chart where:


x-axis → Department


y-axis → Number of employees


Each bar split into Male and Female segments


Colors differentiate gender